/* Задано натуральне число n. Знайти різницю між двома числами, перше з яких побудоване на основі непарних цифр n зліва
 * направо числа, а друге - на основі парних. Якщо 0 буде в найстаршому розряді - пропускати його. Стрічки та масиви не
 * використовувати. Приклади: n = 2352361 -> 3531 - 226, n = 70892014 -> 791 - 8204. */

#include <iostream>
#include <cmath>

using namespace std;
using ll = long long;

int main() {
    ll n;
    cout << "n = ";
    cin >> n;

    ll num1{}, num2{}; // 2 нульові числа на основі непарних і парних
    for (int i = 0, j = 0; n; n /= 10) { // поки n > 0 ділимо його кожен раз на 10
        auto last_digit = n % 10; // остання цифра
        if (last_digit & 1) {  // якщо непарна
            num1 += last_digit * static_cast<ll>(pow(10, i)); // до числа на основі непарних додаємо ост. цифру * 10^i
            ++i;
        } else {
            num2 += last_digit * static_cast<ll>(pow(10, j)); // до числа на основі парних додаємо ост. цифру * 10^j
            ++j;
        }
    }

    auto res = num1 - num2;
    cout << num1 << " - " << num2 << " = " << res << endl;
    return 0;
}