/*
 Написати підпрограми (оформити з використанням *.h файлів) для роботи зі стеком на базі двонапрямного списку.
 Повинні бути методи запису в стек, читання зі стека (типу PUSH та POP) та модифікації вказівника стеку
 (типу роботи з SP - stack pointer). Написати іншу функціональність для керування кількома стеками звертаючись при цьому
 до створених раніше підпрограм. Використовуючи створені підпрограми в основній програмі прочитати масив цілих чисел та
 вивести в оберненому порядку спочатку числа на позиціях, що кратні трьом, а потім всі інші.
 Масив переглядати лише один раз.
*/

#include <fstream>
#include "task_9_5.h"

int main() {
    bool input = false;
    Stack<int> stack1, stack2;
    fstream fs{"task_9_5.txt"};

    for (int i = 1, c; input && cin.peek() != '\n' && cin >> c || !input && fs >> c; ++i)
        (i % 3 ? stack2 : stack1).push(c);

    while (!stack1.empty()) {
        cout << stack1.top() << ' ';
        stack1.pop();
    }

    while (!stack2.empty()) {
        cout << stack2.top() << ' ';
        stack2.pop();
    }
    return 0;
}