/*Прочитати k матриць розміром m*n (2 < m, n < 11), елементами яких є нулі та одиниці. Надрукувати ту з матриць, яка
містить більше об'єктів, що визначаються за таким правилом (подібно до гри “Морський бій”):
    об’єкт визначається лише значенням 1 та є прямокутником довжиною та шириною до 4 клітинок (включно), що може бути
розміщений горизонтально або вертикально;
    заздалегідь відомо, що об'єкти не дотикаються один до одного;
Написати підпрограми (функції або/та процедури) для обчислення кількості об'єктів у матриці, читання і друкування чисел
(та інші допоміжні, якщо потрібно). Декларацію підпрограм оформити у вигляді *.h файла, а код підпрограм розмістити в
окремому *.cpp файлі. Обидва файли додати до проєкту. Код основної програми повинен містити лише виклики підпрограм.*/


#include "task_8_5.h"

int main() {
    const auto matrices = readMatrices(); // масив з об'єктами класу BattleshipMatrix
    for (auto &el: matrices) {
        el.printMatrix();
        cout << "ships: " << el.getShips() << '\n';
    }
    printMatricesWithMaximalNumberOfObjects(matrices); // пошук найбільшої кількості об'єктів
    return 0;
}
/*
3
5 6
1 1 1 1 1 1
0 0 0 0 0 0
1 1 0 1 1 1
0 0 0 0 0 0
1 1 1 1 1 1
5 6
1 1 1 1 1 1
1 1 1 1 1 1
0 0 0 0 0 0
0 0 0 0 1 1
1 1 1 0 1 1
5 6
1 0 1 1 1 1
0 0 1 1 1 1
1 0 1 1 1 1
0 0 1 1 1 1
1 0 1 1 1 1
*/